Repository: n8rob/corpora
Catalog: french_haitian/archive/en-ht (1).tmx
Source language: en
Languages: ht

source: But then when it gets the signal, it dumps it back in and then we actually have a muscle contraction because the tropomyosin gets moved out of the way by the troponin., So I don't know.
ht: Men, lè sa a lè li vin siyal la, li tonbe li tounen nan epi lè sa a nou gen aktyèlman yon tranche nan pye paske a tropomyosin obtient pran an a troponin., se konsa mwen pa konnen.

source: That's pretty fascinating.
ht: Sa vrèman fascinante.

source: It's actually even fascinating that this is still not completely well understood.
ht: Li se aktyèlman jouk fascinante ke sa se p'ap ankò konprann gaya.

source: This is an active-- if you want to become a biological researcher, this could be an interesting thing to try to understand.
ht: Sa a se yon aktivite ­ si ou vle tounen yon Byolojik chèchè, sa te kapab yon bagay ki enteresan pou eseye konprann.

source: One, it's interesting just from a scientific point of view of how this actually functions, but there's actually-- there's maybe potential diseases that are byproducts of malfunctioning proteins right here.
ht: Menm ki la, sèlman nan yon pwen syantifik de enteresan wè ki jan sa a aktyèlman fonctions, men ki pa aktyèlman - la se petèt maladi potansyèl ki se aucune de fonctionnement protéines droit isit la.

source: Maybe you can somehow make these things perform better or worse, or who knows.
ht: Petèt nou ka D' fè bagay sa yo fè pi bon ou pi mal, osinon ki konnen.

source: So there actually are positive impacts that you could have if you actually figured out what exactly is going on here when the action potential shows up to open up this calcium channel.
ht: Se konsa gen aktyèlman sont efè pozitif a sa ou te kapab gen si ou aktyèlman sipoze soti ekzateman sak pase isit la lè a potentiel aksyon montre pou chanèl kalsyòm sa a.

source: So now we have the big picture.
ht: Koulye a nou gen gwo foto an.

source: We know how a motor neuron can stimulate a contraction of a cell by allowing the sarcoplasmic reticulum to allow calcium ions to travel across this membrane in the cytoplasm of the cell.
ht: Nou konnen ki jan yon motè ewonn kapab ankouraje yon tranche de yon selil pèmèt (sarcoplasmic pou pèmèt ions kalsyòm pou l vwayaje len sa a nan dans la cytoplasm de sèlil a.

source: And I was doing a little bit of reading before this video.
ht: E m t ap fè yon ti lekti anvan videyo sa a.

source: These pumps are very efficient.
ht: Pompes sa yo ki trè efikas.

source: So once the signal goes away and this door is closed right here, this this sarcoplasmic reticulum can get back the ion concentration in about 30 milliseconds.
ht: Se konsa une siyal la va ale ak devan pòt Tant sa a te fèmen droit isit la, sa (sarcoplasmic sa a ka reprann ion a konsantrasyon nan anviwon 30 millisecondes.

source: So that's why we're so good at stopping contractions, why I can punch and then pull back my arm and then have it relax all within split-seconds because we can stop the contraction in 30 milliseconds, which is less than 1/30 of a second.
ht: Se konsa, se poutèt sa nou gen bon nan tranche rete, Poukisa mwen ka kout pwen an, apre extraction tounen bra m e gen li Lache kò ou tout nan yon ranp-segond paske nou ka rete a tranche nan 30 millisecondes, ki se moins pase 1/30 de yon dezyèm.

source: So anyway, I'll see in the next video, where we'll study the actual anatomy of a muscle cell in a little bit more detail.
ht: Se konsa mwen ap wè nan pwochen videyo, kote nou ap etidye réel ò moun yon selil nan pye nan yon ti kras plis detay.

source: We've got a scale here, and as you see, the scale is balanced.
ht: Nou genyen yon échelle isit la, menm jan nou wè l ', mezi yo sèvi te balanse.

source: And we have a question to answer.
ht: Apre sa, nou gen yon kesyon pou reponn.

source: We have this mystery mass over here.
ht: Nou dwe fè mès mistè sa a sou isit la.

source: It's a big question mark on this blue mass.
ht: Sa se yon gwo mak kesyon sou pil ble sa a.

source: And we also have a bunch of 1 kilogram masses.
ht: Et, nou gen tou yon pakèt moun yon pil 1 kilogram.

source: These are all each a 1kg mass.
ht: Sa tout chak yon 1kg mas.

source: And my question to you is:
ht: Apre sa, m' mande nou la a se:

source: What could we do to either side of this scale in order to figure out what the mystery mass is?
ht: Sa te kapab nou fè pou youn ou lòt bò larivyè échelle sa a pou evalye ki a mistè mès se?

source: Or maybe we can't figure it out at all?
ht: Ou gen dwa nou pa ka evalye li menm menm menm?

source: Is there something that we can do either removing or adding these things, so that we can figure out what this mystery mass is?
ht: Èske gen yon bagay ke nou kapab fè swa retire ou ajoute ke bagay sa yo, Lè sa a, nou ka evalye ki sa a mistè mès se?

source: I will give you a couple of seconds to think about it.
ht: M' ap ban nou yon koup segond panse osijè de sa.

source: To figure out what this mystery mass is, we essentially just want this on one side of this scale
ht: Pou evalye sa a ki mistè mès se, nou esansyèlman jis vle sa a sou yon bò échelle sa a

source: But that by itself is not enough.
ht: Men sa ki pou kont li pa ase.

source: We could just remove these three, but that won't do the job, because if we just remove these three, then the left side of this scale is clearly going to have less mass, and it will go up, and the right side will go down.
ht: Nou te kapab sèlman retire sa twa, Men, sa pa p fè travay la, paske Si nou jis retire sa twa,

source: And that will not give us much information.
ht: Et, sa p'ap ban nou anpil enfòmasyon.

source: It would just tell us that this blue thing has a lower mass than what is over here.
ht: Li ta ka sèlman di nou sa koulye a ble bagay te gen yon pil pi ba pase sa ki pase isit la.

source: So just removing this will not help us much.
ht: Se konsa jis retire sa a pa ede nou anpil.

source: I won't let us know that this is equal to that.
ht: Mwen fè nou pa konnen ke sa rive fè sa.

source: What we have to do if we want to keep the scale balanced, is that we have to remove the same amount of mass from both sides of the scale.
ht: Sa nou dwe fè si nou vle pou mezi yo sèvi balanse, se pou nou gen pou retire menm kantite mès de de mezi yo sèvi kote.

source: So, if we want to remove 3 things here, (let me try my best to remove 3 things here) (I will just erase it)
ht: Konsa, si nou vle pou retire 3 bagay isit la, (mwen eseye m' pi bon pou retire 3 sa isit la se) (Mwen pral jis efase sa)

source: If we want to remove 3 things there,
ht: Si nou vle pou retire 3 bagay la.

source: If we did this by itself, just removed these 3 things, the two sides would not have an equal mass anymore. this side would have a lower mass.
ht: Si nou te fè sa ki pou kont li, jis te retire 3 bagay sa yo, tou de bò pa ta gen yon bon bit ankò. kote sa a pwal gen yon sèl kote pi ba.

source: So we have to remove 3 from both sides.
ht: Se poutèt sa, nou dwe retire 3 nan tou de kote yo.

source: If we want to make sure our scale is balanced, we have to remove 3 from both sides.
ht: Si nou vle si ke sistèm yo sèvi nou te balanse, nou gen pou retire 3 nan tou de kote yo.

source: If we started off with the scales balanced, and then we removed 3 from both sides, the scale will still be balanced and then we would have a clear idea of what the mass of this object actually is.
ht: Si nou te kòmanse ak balans balanse, Et te lè sa a nou retire 3 nan tou de bò, mezi yo sèvi va toujou ap balanse epi lè sa a nou pwal gen yon lide klè ki pil objet sa a aktyèlman se.

source: Now, with 3 removed from both sides, the scale will still be balanced, and we know that this mass is equal to whatever is left over here.
ht: Koulye a, ak 3 te retire nan tou de bò, mezi yo sèvi va toujou ap balanse, e nou konnen ke mas sa a rive fè tou sa rete sou isit la.

source: It is equal to 1, 2, 3, 4, 5, 6, 7
ht: Li rive fè 1, 2, 3, 4, 5, 6, 7

source: - and if we're assuming they are kilograms - we'll know that the question mark mass question mark is equal to 7 kilograms.
ht: - Et si nou ap en yo sont kg- nou ap konnen ke kesyon an make mès pwen entèwogasyon egal a 7 kg.

source: So this is a seven kilogram mass.
ht: Se poutèt sa, se sa rele yon sèt kilogram mas.

source: What I'm going to attempt to do in the next two videos is really just give an overview of everything that's happened to Earth since it came into existence.
ht: Kisa mwen pral seye fè nan regard de vidéos se vwèman inikman bay yon kourikoulòm tou sa ki te pase sou latè depi ke li te kreye.

source: We're going start really at the formation of Earth or the formation of our Solar system or the formation of the Sun, and our best sense of what actually happened is that there was a supernova in our vicinity of the galaxy, and this right here is a picture of a supernova remnant, actually, the remnant for Kepler's supernova.
ht: Nou ap kòmanse ale vrèman nan fòmasyon ki sou latè oswa sistèm solè nou òdone fòmasyon ou òdone fòmasyon Solèy la, e nou santi sa aktyèlman qui se sa te gen yon supernova nan nou à galaksi an, isit-menm se yon foto yon koupon gen supernova, aktyèlman, la koupon pou Kepler a supernova.

source: The supernova in this picture actually happened four hundred years ago in 1604, so right at the center a star essentially exploded and for a few weeks was the brightest object in the night sky, and it was observed by Kepler and other people in 1604, and this is what it looks like now.
ht: A supernova nan foto sa a aktyèlman te rive katsan (400) ane de sa nan 1604, te pou regle nan mitan yon zetwal esansyèlman eksploze pou kèk semèn te gen la plus objet nan syèl lannwit la, e li te bay pou obsève pa Kepler ak lòt moun nan 1604, Apre sa, se sa li sanble tankou koulye a.

source: What we see is kinda the shockwave that's been traveling out for the past 400 years, so now it must be many
ht: Sa nou wè se yon jan shockwave ke li te vwayaje soti pou 400 ane ki sot pase yo, koulye a li dwe anpil

source: light years across.
ht: limyè ans dans.

source: It wasn't, obviously, matter wasn't traveling at the speed of light, but it must've been traveling pretty, pretty fast, at least relativistic speeds, a reasonable fraction of the speed of light.
ht: Se pa, li evidan, pwoblèm pa t vwayaje nan gwo vitès nan limyè, men, li dwe te vwayaje assez, assez rapide, omwen relativiste deplasman, yon rezonab fraksyon de gwo vitès limyè.

source: This has traveled a good bit out now, but what you can imagine is when you have the shockwave traveling out from a supernova, let's say you had a cloud of molecules, a cloud of gas, that before the shockwave came by just wasn't dense enough for gravity to take over, and for it to accrete, essentially, into a solar system.
ht: Sa te vwayaje yon bon ti soti koulye a, men, sa ou kapab kwè se lè ou gen a shockwave vwayaje de yon supernova, an n ap di ou pa gen yon gwo nwaj de molécules, yon gwo nwaj de gaz ki devan shockwave a te vin pou pa jis pa t dans ase pou gravite pou pwan, epi pou l' accrete, esansyèlman, nan yon sistèm solè.

source: When the shockwave passes by it compresses all of this gas and all of this material and all of these molecules, so it now does have that critical density to form, to accrete into a star and a solar system.
ht: Lè shockwave a rann li compresses tout sa a gaz Et, tout materyèl sa yo ak tout de molécules sa yo, se konsa li kounye a gen sa dansite kritik pou fòm pou accrete nan yon zetwal yo ak yon sistèm solè.

source: We think that's what's happened, and the reason why we feel pretty strongly that it must've been caused by a supernova is that the only way that the really heavy elements can form, or the only way we know that they can form is in kind of the heat of a supernova, and our uranium, the uranium that seems to be in our solar system on Earth, seems to have formed roughly at the time of the formation of Earth, at about four and a half billion years ago, and we'll talk in a little bit more depth in future videos on exactly how people figure that out, but since the uranium seems about the same age as our solar system, it must've been formed at around the same time, and it must've been formed by a supernova, and it must be coming from a supernova, so a supernova shockwave must've passed through our part of the universe, and that's a good reason for gas to get compressed and begin to accrete.
ht: Nou panse sa se sa a te pase, Et la raison Poukisa nou santi très fortement ke li dwe te koze yon supernova se sèl mwayen ki vrèman lou eleman yo tande sa jan yo ka fòme ou sèl fason nou konnen ke yo ka fòme nan ti jan de chalè a de yon supernova, Et Iranyòm nou, Iranyòm sa semble pou li nan sistèm solè nou sou latè a, sanble pou fòme environ lè a yo te òdone fòmasyon sou latè, nan osijè de kat pous bilyon ane de sa, e nou ap pale nan yon ti kras plis pwofondè nan pwochen vidéos sou exactement jan figi moun sa soti, men, depi Iranyòm a semble osijè de te menm laj kòm nou sistèm solè an, li dwe te fòme nan alantou an menm tan an, e li dwe te fòme pa yon supernova, e li dwe vini nan yon supernova, se konsa yon supernova shockwave dwe te pase atravè nou pati nan Linivè, e se yon rezon pou gaz pou jwenn compressés Et kòmanse pou accrete.

source: So you fast-forward a few million years.
ht: Se konsa nou rapide kèk milyon ane.

source: That gas would've accreted into something like this.
ht: Gaz sa ta te accreted nan yon bagay konsa.

source: It would've reached the critical temperature, critical density and pressure at the center for ignition to occur, for fusion to start to happen, for hydrogen to start fusing into helium, and this right here is our early sun.
ht: Li ta gen atteint kritik tanperati a, kritik dansite Et pwesyon sou nan sant pou D' pou se pou pou fon pou kòmanse pou sa pase pou Idwojèn pou yo kòmanse fondman nan Elyòm, Et droit isit la se sa nou byen bonè solèy.

source: Around the sun you have all of the gases and particles and molecules that had enough angular velocity to not fall into the sun, to go into orbit around the sun.
ht: Nan solèy la ou gen tout de gaz la ak matyè Et molécules sa a vitès angilè ase pou nou pa tonbe nan solèy la, antre nan òbit ozanviwon solèy la.

source: They were actually supported by a little bit of pressure, too, because you can kinda view this as kind of a big cloud of gas, so they're always bumping into each other, but for the most part it was their angular velocity, and over the next tens of millions of years they'll slowly bump into each other and clump into each other.
ht: Yo te aktyèlman sipòte pa yon ti van, tou, Paske, ou kapab yon jan wè sa tankou jan de yon gwo nwaj gaz, Se konsa yo ap toujou ainsi ak lòt, men pou pati ki plis

source: Even small particles have gravity, and they're gonna slowly become rocks and asteroids and, eventually, what we would call
ht: Matyè menm ti ont gravite, Et yo pwal bay pi dousman devenir wòch Et astéroïdes Et, evantyèlman, sa nou ta rele

source: "planetesimals," which are, kinda view them as seeds of planets or early planets, and then those would have a reasonable amount of gravity and other things would be attracted to them and slowly clump up to them.
ht: "planetesimals,", yon jan wè yo tankou grenn Des planètes ou byen bonè planètes, ak lè sa a moun yo ta gen yon montan rezonab gravite ak lòt bagay ta a yo Et dousman clump nan men yo.

source: This wasn't like a simple process, you know, you could imagine you might have one planetesimal form, and then there's another planetesimal formed, and instead of having a nice, gentle those two guys accreting into each other, they might have huge relative velocities and ram into each other, and then just, you know, shatter, so this wasn't just a nice, gentle process of constant accretion.
ht: Sa pa t tankou yon senp pwosè, ou konnen, ou te kapab imajine ou te ka jwenn yon fòm planetesimal, epi lè sa a se yon lòt planetesimal te fòme, Et olye ke yo gen yon bèl, douce yo tout de accreting ak lòt, yo ta dwe yon gwo vitesses relatif Et ram nan ak lòt, ak sèlman lè sa a, ou konnen, se, pou sa pa t jis yon bon, san lògèy pwosesis de accumulation toutan.

source: It would actually have been a very violent process, actually happened early in Earth's history, and we actually think this is why the Moon formed, so at some point you fast-forward a little bit from this, Earth would have formed,
ht: Aktyèlman te gen yon pwosè sitèlman cho, aktyèlman te pase byen bonè nan istwa sou latè a, e nou aktyèlman panse Se poutèt sa, lalin lan fòme, sa nan kèk pwen sa ou yon ti jan rapide de sa, sou latè ta te fòme,

source: I should say, the mass that eventually becomes our modern Earth would have been forming.
ht: Mwen ta dwe di: mès la ki vin pou nou sou latè a la mòd ta ont te kreye.

source: Let me draw it over here.
ht: Pou m' fè l' pase isit la.

source: So, let's say that that is our modern Earth, and what we think happened is that another proto-planet or another, it was actually a planet because it was roughly the size of Mars, ran into our, what it is eventually going to become our Earth.
ht: Se poutèt sa, ann di ke sa se nou sou latè a la mòd, e kisa nou panse qui se sa yon lòt proto-planèt ou nan yon lòt, se te aktyèlman yon planèt, paske li te environ la taille de Mars, la te nan nou, li evantyèlman sak pou nou sou latè.

source: This is actually a picture of it.
ht: Sa se aktyèlman yon foto sa a.

source: This is an artist's depiction of that collision, where this planet right here is the size of Mars, and it ran into what would eventually become Earth.
ht: Sa se représentation yon atis de kolizyon sa, ki kote planèt sa a droit isit la se la taille de Mars, e li te kouri nan sa ta evantyèlman rive sou latè.

source: This we call Theia.
ht: Sa nou rele Theia.

source: This is Theia, and what we believe happened, and if you look up, if you go onto the Internet, you'll see some simulations that talk about this, is that we think it was a glancing blow.
ht: Se sa rele Theia, Kisa nou kwè est, Et si ou gade Si ou ale sou entènèt la, ou ap wè kèk simulations ki pale sou sa, se pou nou panse ke se te yon souflèt glancing.

source: It wasn't a direct hit that would've just kinda shattered each of them and turned into one big molten ball.
ht: Se pa yon chòk dirèk ki ta te gen sèlman yon jan pou kraze chak nan nan yon sèl gwo boul en ak yo.

source: We think it was a glancing blow, something like this.
ht: Nou panse ke se te yon kou glancing, yon bagay tankou sa a.

source: This was essentially Earth.
ht: Sa te esansyèlman sou latè.

source: Obviously, Earth got changed dramatically once Theia ran into it, but Theia is right over here, and we think it was a glancing blow.
ht: Evidamman, latè a chanje dramatikman une Theia la te nan men l, men, se nan Theia droit sou isit la, e nou panse li te genyen yon glancing soufle.

source: It came and it hit Earth at kind of an angle, and then it obviously the combined energies from that interaction would've made both of them molten, and frankly they probably already were molten because you had a bunch of smaller collisions and accretion events and
ht: L' epi li a te fwape nan ti jan yon ang. Apre sa li

source: little things hitting the surface, so probably both of them during this entire period, but this would've had a glancing blow on Earth and essentially splashed a bunch of molten material out into orbit.
ht: Evidamman konbine énergies de entèraksyon sa ta te fè tou de peyi yo en, Et kare pwobableman deja yo en paske ou te gen yon pakèt moun collisions plus Et evènman accumulation Et ti bagay Sur sifas la, se konsa pwobableman Les yo pandan sa a tout tan, men, sa ta te gen yon glancing frape sou latè ak yon pakèt ki pou realize esansyèlman de en materyèl soti sou òbit.

source: It would've just come in, had a glancing blow on Earth, and then splashed a bunch of molten material, some of it would've been captured by Earth, so this is the before and the after, you can imagine, Earth is kind of this molten, super hot ball, and some of it just gets splashed into orbit from the collision.
ht: Li ta ka sèlman vini, te gen yon souflèt glancing sou latè, epi lè sa a ki pou realize yon pakèt moun en materyèl sa, gen kèk moun li ta te kaptire pa sou latè, se poutèt sa a devan Et la apre sa, ou ka konprann, sou latè se jan de sa a boul en, super cho, ak kèk de l pou jis obtient realize sou òbit de kolizyon an.

source: Let me just see if I can draw Theia here, so
ht: Fè m' annik wè si mwen kapab trase Theia isit la, se konsa

source: Theia has collided, and it is also molten now because huge energies, and it splashes some of it into orbit.
ht: Theia a, e li tou en kounye a paske li yon gwo énergies, Et sa toute san an sou òbit.

source: If we fast-forward a little bit, this stuff that got splashed into orbit, it's going in that direction, that becomes our Moon, and then the rest of this material eventually kind of condenses back into a spherical shape and is what we now call our Earth.
ht: Si nou rapide yon ti kras, bagay sa a sa a ki pou realize sou òbit, li pwal nan sa dirèksyon, sa est Lè sa a tout rès twal sa evantyèlman ti jan condenses nan yon fòm "Et sa a nou kounye a rele nou sou latè.

source: So that's how we actually think right now that the Moon actually formed.
ht: Se poutèt sa se jan nou aktyèlman panse kounye a ke lalin lan aktyèlman fòme.

source: Even after this happened, the Earth still had a lot more,
ht: Menm si apre sa rive, tè a toujou te gen anpil ankò, se

source: I guess, violence to experience.
ht: Mwen devine, vyolans pou expérience.

source: Just to get a sense of where we are in the history of Earth, we're going to refer to this time clock a lot over the next few videos, this time clock starts right here at the formation of our solar system, 4.6 billion years ago, probably coinciding with some type of supernova, and as we go clockwise on this diagram, we're moving forward in time, and we're gonna go all the way forward to the present period, and just so you understand some of the terminology,
ht: Sèlman pou jwenn yon sans de kote ke nou kap nan istwa sou latè, nou pwal fè referans a lè tan sa a anpil sou kèk vidéos kap vini yo, Lè sa a, lè a commence isit nan sistèm solè nou an, òdone fòmasyon 4.6 bilyon ane de sa, pwobableman qui ak de supernova, menm jan n' ap wotasyon egui yon mont dyagram sa a, nou ap fè pi devan nan tan, e nou pral ale tout wout pou peryòd la a, pou Et jis pou ou konprann gen kèk de terminologie a,

source: "Ga" means "billions of years ago"
ht: "Ga" vle di "milliards de ane de sa"

source: 'G' for "Giga-"
ht: 'G' pou "Giga-"

source: "Ma" means "millions of years ago"
ht: "Gran" vle di "anpil milyon ane de sa"

source: 'M' for "Mega-"
ht: Je ' pou "Mega-"

source: So where we are right now, the Moon has formed, and we're in what we call the Hadean period or actually I shouldn't say "period."
ht: Se konsa kote nou ye kounye a, lalin lan te fòme, Et nan sa nou rele peryòd Hadean a ou, mwen pa ta dwe di ke "peryòd."

source: It's the Hadean eon of Earth.
ht: Li se eon Hadean ki sou latè.

source: "Period" is actually another time period, so let me make this very clear.
ht: "Peryòd" se aktyèlman yon lòt lè peryòd se pou m' fè sa trè klè.

source: It's the Hadean, we are in the Hadean eon, and an eon is kind of the largest period of time that we talk about, especially relative to Earth, and it's roughly 500 million to a billion years is an eon, and what makes the Hadean eon distinctive, well, from a geological point of view what makes it distinctive is really we don't have any rocks from the
ht: Se Hadean la, nou nan Hadean a, eon a, e eon yon ti jan a pi gwo peryòd de tan sa nou pale sou, sitou sa k paran sou latè, e li gen environ 500 milyon dola pou yon milyon dola an se yon eon, ak kisa ki fè eon Hadean a distinctive, Men, nan yon géologique pwen de vi Kisa k fè li distinctive se vrèman nou pa gen okenn wòch de la
